HOLAZA   SUBENTRY BASES=(3)
         OPEN     (ARCH,(INPUT))
LEER     GET      ARCH,WORD
         WTO      MF=(E,WTO1)
         B        LEER
EOF      CLOSE    ARCH
         SUBEXIT

ARCH     DCB     DSNAME=ARCHIVO,LRECL=8,RECFM=FT,MACRF=GM,EODAD=EOF
ARCHIVO  DC      C'saraza',X'00'

WTO1     DC      H'12'
         DC      H'0'
WORD     DS      CL8' '

*        END
